Microchip-MPLAB-Harmony/ethercat/apps/ethercat_counter_foe_app/firmware/src/packs/ATSAMD51J19A_DFP/component/fuses.h
/* -------- FUSES_TEMP_LOG_WORD_2 : (FUSES Offset: 0x08) ( R/ 32) TEMP_LOG Page Word 2 -------- */
#define FUSES_TEMP_LOG_WORD_2_ROOM_ADC_VAL_CTAT_Pos _U_(0)                                               /**< (FUSES_TEMP_LOG_WORD_2) 12-bit ADC conversion at room temperature CTAT Position */
#define FUSES_TEMP_LOG_WORD_2_ROOM_ADC_VAL_CTAT_Msk (_U_(0xFFF) << FUSES_TEMP_LOG_WORD_2_ROOM_ADC_VAL_CTAT_Pos) /**< (FUSES_TEMP_LOG_WORD_2) 12-bit ADC conversion at room temperature CTAT Mask */
#define FUSES_TEMP_LOG_WORD_2_ROOM_ADC_VAL_CTAT(value) (FUSES_TEMP_LOG_WORD_2_ROOM_ADC_VAL_CTAT_Msk & ((value) << FUSES_TEMP_LOG_WORD_2_ROOM_ADC_VAL_CTAT_Pos))
#define FUSES_TEMP_LOG_WORD_2_HOT_ADC_VAL_CTAT_Pos _U_(12)                                              /**< (FUSES_TEMP_LOG_WORD_2) 12-bit ADC conversion at hot temperature CTAT Position */
#define FUSES_TEMP_LOG_WORD_2_HOT_ADC_VAL_CTAT_Msk (_U_(0xFFF) << FUSES_TEMP_LOG_WORD_2_HOT_ADC_VAL_CTAT_Pos) /**< (FUSES_TEMP_LOG_WORD_2) 12-bit ADC conversion at hot temperature CTAT Mask */
#define FUSES_TEMP_LOG_WORD_2_HOT_ADC_VAL_CTAT(value) (FUSES_TEMP_LOG_WORD_2_HOT_ADC_VAL_CTAT_Msk & ((value) << FUSES_TEMP_LOG_WORD_2_HOT_ADC_VAL_CTAT_Pos))
#define FUSES_TEMP_LOG_WORD_2_Msk             _U_(0x00FFFFFF)                                      /**< (FUSES_TEMP_LOG_WORD_2) Register Mask  */


/* -------- FUSES_SW0_WORD_0 : (FUSES Offset: 0x00) ( R/ 32) SW0 Page Word 0 -------- */
#define FUSES_SW0_WORD_0_AC_BIAS0_Pos         _U_(0)                                               /**< (FUSES_SW0_WORD_0) PAIR0 Bias Calibration Position */
#define FUSES_SW0_WORD_0_AC_BIAS0_Msk         (_U_(0x3) << FUSES_SW0_WORD_0_AC_BIAS0_Pos)          /**< (FUSES_SW0_WORD_0) PAIR0 Bias Calibration Mask */
#define FUSES_SW0_WORD_0_AC_BIAS0(value)      (FUSES_SW0_WORD_0_AC_BIAS0_Msk & ((value) << FUSES_SW0_WORD_0_AC_BIAS0_Pos))
#define FUSES_SW0_WORD_0_ADC0_BIASCOMP_Pos    _U_(2)                                               /**< (FUSES_SW0_WORD_0) ADC Comparator Scaling Position */
#define FUSES_SW0_WORD_0_ADC0_BIASCOMP_Msk    (_U_(0x7) << FUSES_SW0_WORD_0_ADC0_BIASCOMP_Pos)     /**< (FUSES_SW0_WORD_0) ADC Comparator Scaling Mask */
#define FUSES_SW0_WORD_0_ADC0_BIASCOMP(value) (FUSES_SW0_WORD_0_ADC0_BIASCOMP_Msk & ((value) << FUSES_SW0_WORD_0_ADC0_BIASCOMP_Pos))
#define FUSES_SW0_WORD_0_ADC0_BIASREFBUF_Pos  _U_(5)                                               /**< (FUSES_SW0_WORD_0) ADC Bias Reference Buffer Scaling Position */
#define FUSES_SW0_WORD_0_ADC0_BIASREFBUF_Msk  (_U_(0x7) << FUSES_SW0_WORD_0_ADC0_BIASREFBUF_Pos)   /**< (FUSES_SW0_WORD_0) ADC Bias Reference Buffer Scaling Mask */
#define FUSES_SW0_WORD_0_ADC0_BIASREFBUF(value) (FUSES_SW0_WORD_0_ADC0_BIASREFBUF_Msk & ((value) << FUSES_SW0_WORD_0_ADC0_BIASREFBUF_Pos))
#define FUSES_SW0_WORD_0_ADC0_BIASR2R_Pos     _U_(8)                                               /**< (FUSES_SW0_WORD_0) ADC Bias R2R ampli scaling Position */
#define FUSES_SW0_WORD_0_ADC0_BIASR2R_Msk     (_U_(0x7) << FUSES_SW0_WORD_0_ADC0_BIASR2R_Pos)      /**< (FUSES_SW0_WORD_0) ADC Bias R2R ampli scaling Mask */
#define FUSES_SW0_WORD_0_ADC0_BIASR2R(value)  (FUSES_SW0_WORD_0_ADC0_BIASR2R_Msk & ((value) << FUSES_SW0_WORD_0_ADC0_BIASR2R_Pos))
#define FUSES_SW0_WORD_0_ADC1_BIASCOMP_Pos    _U_(16)                                              /**< (FUSES_SW0_WORD_0) ADC Comparator Scaling Position */
#define FUSES_SW0_WORD_0_ADC1_BIASCOMP_Msk    (_U_(0x7) << FUSES_SW0_WORD_0_ADC1_BIASCOMP_Pos)     /**< (FUSES_SW0_WORD_0) ADC Comparator Scaling Mask */
#define FUSES_SW0_WORD_0_ADC1_BIASCOMP(value) (FUSES_SW0_WORD_0_ADC1_BIASCOMP_Msk & ((value) << FUSES_SW0_WORD_0_ADC1_BIASCOMP_Pos))
#define FUSES_SW0_WORD_0_ADC1_BIASREFBUF_Pos  _U_(19)                                              /**< (FUSES_SW0_WORD_0) ADC Bias Reference Buffer Scaling Position */
#define FUSES_SW0_WORD_0_ADC1_BIASREFBUF_Msk  (_U_(0x7) << FUSES_SW0_WORD_0_ADC1_BIASREFBUF_Pos)   /**< (FUSES_SW0_WORD_0) ADC Bias Reference Buffer Scaling Mask */
#define FUSES_SW0_WORD_0_ADC1_BIASREFBUF(value) (FUSES_SW0_WORD_0_ADC1_BIASREFBUF_Msk & ((value) << FUSES_SW0_WORD_0_ADC1_BIASREFBUF_Pos))
#define FUSES_SW0_WORD_0_ADC1_BIASR2R_Pos     _U_(22)                                              /**< (FUSES_SW0_WORD_0) ADC Bias R2R ampli scaling Position */
#define FUSES_SW0_WORD_0_ADC1_BIASR2R_Msk     (_U_(0x7) << FUSES_SW0_WORD_0_ADC1_BIASR2R_Pos)      /**< (FUSES_SW0_WORD_0) ADC Bias R2R ampli scaling Mask */
#define FUSES_SW0_WORD_0_ADC1_BIASR2R(value)  (FUSES_SW0_WORD_0_ADC1_BIASR2R_Msk & ((value) << FUSES_SW0_WORD_0_ADC1_BIASR2R_Pos))
#define FUSES_SW0_WORD_0_Msk                  _U_(0x01FF07FF)                                      /**< (FUSES_SW0_WORD_0) Register Mask  */


/* -------- FUSES_SW0_WORD_1 : (FUSES Offset: 0x04) ( R/ 32) SW0 Page Word 1 -------- */
#define FUSES_SW0_WORD_1_USB_TRANSN_Pos       _U_(0)                                               /**< (FUSES_SW0_WORD_1) USB pad Transn calibration Position */
#define FUSES_SW0_WORD_1_USB_TRANSN_Msk       (_U_(0x1F) << FUSES_SW0_WORD_1_USB_TRANSN_Pos)       /**< (FUSES_SW0_WORD_1) USB pad Transn calibration Mask */
#define FUSES_SW0_WORD_1_USB_TRANSN(value)    (FUSES_SW0_WORD_1_USB_TRANSN_Msk & ((value) << FUSES_SW0_WORD_1_USB_TRANSN_Pos))
#define FUSES_SW0_WORD_1_USB_TRANSP_Pos       _U_(5)                                               /**< (FUSES_SW0_WORD_1) USB pad Transp calibration Position */
#define FUSES_SW0_WORD_1_USB_TRANSP_Msk       (_U_(0x1F) << FUSES_SW0_WORD_1_USB_TRANSP_Pos)       /**< (FUSES_SW0_WORD_1) USB pad Transp calibration Mask */
#define FUSES_SW0_WORD_1_USB_TRANSP(value)    (FUSES_SW0_WORD_1_USB_TRANSP_Msk & ((value) << FUSES_SW0_WORD_1_USB_TRANSP_Pos))
#define FUSES_SW0_WORD_1_USB_TRIM_Pos         _U_(10)                                              /**< (FUSES_SW0_WORD_1) USB pad Trim calibration Position */
#define FUSES_SW0_WORD_1_USB_TRIM_Msk         (_U_(0x7) << FUSES_SW0_WORD_1_USB_TRIM_Pos)          /**< (FUSES_SW0_WORD_1) USB pad Trim calibration Mask */
#define FUSES_SW0_WORD_1_USB_TRIM(value)      (FUSES_SW0_WORD_1_USB_TRIM_Msk & ((value) << FUSES_SW0_WORD_1_USB_TRIM_Pos))
#define FUSES_SW0_WORD_1_Msk                  _U_(0x00001FFF)                                      /**< (FUSES_SW0_WORD_1) Register Mask  */


/* -------- FUSES_USER_WORD_0 : (FUSES Offset: 0x00) (R/W 32) USER Page Word 0 -------- */
#define FUSES_USER_WORD_0_BOD33_DIS_Pos       _U_(0)                                               /**< (FUSES_USER_WORD_0) BOD33 Disable Position */
#define FUSES_USER_WORD_0_BOD33_DIS_Msk       (_U_(0x1) << FUSES_USER_WORD_0_BOD33_DIS_Pos)        /**< (FUSES_USER_WORD_0) BOD33 Disable Mask */
#define FUSES_USER_WORD_0_BOD33_DIS(value)    (FUSES_USER_WORD_0_BOD33_DIS_Msk & ((value) << FUSES_USER_WORD_0_BOD33_DIS_Pos))
#define FUSES_USER_WORD_0_BOD33USERLEVEL_Pos  _U_(1)                                               /**< (FUSES_USER_WORD_0) BOD33 User Level Position */
#define FUSES_USER_WORD_0_BOD33USERLEVEL_Msk  (_U_(0xFF) << FUSES_USER_WORD_0_BOD33USERLEVEL_Pos)  /**< (FUSES_USER_WORD_0) BOD33 User Level Mask */
#define FUSES_USER_WORD_0_BOD33USERLEVEL(value) (FUSES_USER_WORD_0_BOD33USERLEVEL_Msk & ((value) << FUSES_USER_WORD_0_BOD33USERLEVEL_Pos))
#define FUSES_USER_WORD_0_BOD33_ACTION_Pos    _U_(9)                                               /**< (FUSES_USER_WORD_0) BOD33 Action Position */
#define FUSES_USER_WORD_0_BOD33_ACTION_Msk    (_U_(0x3) << FUSES_USER_WORD_0_BOD33_ACTION_Pos)     /**< (FUSES_USER_WORD_0) BOD33 Action Mask */
#define FUSES_USER_WORD_0_BOD33_ACTION(value) (FUSES_USER_WORD_0_BOD33_ACTION_Msk & ((value) << FUSES_USER_WORD_0_BOD33_ACTION_Pos))
#define   FUSES_USER_WORD_0_BOD33_ACTION_NONE_Val _U_(0x0)                                             /**< (FUSES_USER_WORD_0) No action  */
#define   FUSES_USER_WORD_0_BOD33_ACTION_RESET_Val _U_(0x1)                                             /**< (FUSES_USER_WORD_0) The BOD33 generates a reset  */
#define   FUSES_USER_WORD_0_BOD33_ACTION_INT_Val _U_(0x2)                                             /**< (FUSES_USER_WORD_0) The BOD33 generates an interrupt  */
#define   FUSES_USER_WORD_0_BOD33_ACTION_BKUP_Val _U_(0x3)                                             /**< (FUSES_USER_WORD_0) The BOD33 puts the device in backup sleep mode  */
#define FUSES_USER_WORD_0_BOD33_ACTION_NONE   (FUSES_USER_WORD_0_BOD33_ACTION_NONE_Val << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /**< (FUSES_USER_WORD_0) No action Position  */
#define FUSES_USER_WORD_0_BOD33_ACTION_RESET  (FUSES_USER_WORD_0_BOD33_ACTION_RESET_Val << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /**< (FUSES_USER_WORD_0) The BOD33 generates a reset Position  */
#define FUSES_USER_WORD_0_BOD33_ACTION_INT    (FUSES_USER_WORD_0_BOD33_ACTION_INT_Val << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /**< (FUSES_USER_WORD_0) The BOD33 generates an interrupt Position  */
#define FUSES_USER_WORD_0_BOD33_ACTION_BKUP   (FUSES_USER_WORD_0_BOD33_ACTION_BKUP_Val << FUSES_USER_WORD_0_BOD33_ACTION_Pos) /**< (FUSES_USER_WORD_0) The BOD33 puts the device in backup sleep mode Position  */
#define FUSES_USER_WORD_0_BOD33_HYST_Pos      _U_(11)                                              /**< (FUSES_USER_WORD_0) BOD33 Hysteresis Position */
#define FUSES_USER_WORD_0_BOD33_HYST_Msk      (_U_(0xF) << FUSES_USER_WORD_0_BOD33_HYST_Pos)       /**< (FUSES_USER_WORD_0) BOD33 Hysteresis Mask */
#define FUSES_USER_WORD_0_BOD33_HYST(value)   (FUSES_USER_WORD_0_BOD33_HYST_Msk & ((value) << FUSES_USER_WORD_0_BOD33_HYST_Pos))
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos _U_(26)                                              /**< (FUSES_USER_WORD_0) Bootloader Size Position */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Msk (_U_(0xF) << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) Bootloader Size Mask */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT(value) (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Msk & ((value) << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos))
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_0_Val _U_(0xF)                                             /**< (FUSES_USER_WORD_0) 0 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_8_Val _U_(0xE)                                             /**< (FUSES_USER_WORD_0) 8 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_16_Val _U_(0xD)                                             /**< (FUSES_USER_WORD_0) 16 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_24_Val _U_(0xC)                                             /**< (FUSES_USER_WORD_0) 24 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_32_Val _U_(0xB)                                             /**< (FUSES_USER_WORD_0) 32 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_40_Val _U_(0xA)                                             /**< (FUSES_USER_WORD_0) 40 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_48_Val _U_(0x9)                                             /**< (FUSES_USER_WORD_0) 48 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_56_Val _U_(0x8)                                             /**< (FUSES_USER_WORD_0) 56 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_64_Val _U_(0x7)                                             /**< (FUSES_USER_WORD_0) 64 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_72_Val _U_(0x6)                                             /**< (FUSES_USER_WORD_0) 72 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_80_Val _U_(0x5)                                             /**< (FUSES_USER_WORD_0) 80 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_88_Val _U_(0x4)                                             /**< (FUSES_USER_WORD_0) 88 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_96_Val _U_(0x3)                                             /**< (FUSES_USER_WORD_0) 96 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_104_Val _U_(0x2)                                             /**< (FUSES_USER_WORD_0) 104 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_112_Val _U_(0x1)                                             /**< (FUSES_USER_WORD_0) 112 kbytes  */
#define   FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_120_Val _U_(0x0)                                             /**< (FUSES_USER_WORD_0) 120 kbytes  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_0  (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_0_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 0 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_8  (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_8_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 8 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_16 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_16_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 16 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_24 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_24_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 24 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_32 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_32_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 32 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_40 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_40_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 40 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_48 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_48_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 48 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_56 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_56_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 56 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_64 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_64_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 64 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_72 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_72_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 72 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_80 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_80_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 80 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_88 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_88_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 88 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_96 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_96_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 96 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_104 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_104_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 104 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_112 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_112_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 112 kbytes Position  */
#define FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_120 (FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_120_Val << FUSES_USER_WORD_0_NVMCTRL_BOOTPROT_Pos) /**< (FUSES_USER_WORD_0) 120 kbytes Position  */
#define FUSES_USER_WORD_0_Msk                 _U_(0x3C007FFF)                                      /**< (FUSES_USER_WORD_0) Register Mask  */


